[
  {
    "name": "Akira Kurogane",
    "company": "Stardom",
    "imageURL": "AkiraKuroganeStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Ami Sohrei",
    "company": "Stardom",
    "imageURL": "AmiSohreiStardom.png",
    "division": "Women's",
    "bio": "She debuted as Miura Ami in Actress Girls, quickly distinguishing herself with power beyond that of a newcomer. At Stardom's Ryogoku Kokugikan event on March 26, 2022, she appeared as the 'strongest bodyguard' as predicted by Akari. She then joined Akari's newly formed unit, God's Eye. On October 19, 2022, at the Shinjuku Sumitomo Hall event, she defeated Hanan to win the Future Championship. In the 2024 Cinderella Tournament, she advanced to the finals but was narrowly defeated by Hanan. With her impressive fighting skills, attention is focused on her further achievements this year."
  },
  {
    "name": "Anne Kanaya",
    "company": "Stardom",
    "imageURL": "AnneKanayaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Aya Sakura",
    "company": "Stardom",
    "imageURL": "AyaSakuraStardom.png",
    "division": "Women's",
    "bio": "She holds a black belt in Shitoryu Karate. While working towards becoming an action actress, she mistakenly attended a Stardom audition for a new talent, thinking it was an audition for Iwatani Mayu's autobiographical film, and ended up becoming a trainee. In her debut match, she fought fearlessly against Julia, the world champion at the time, displaying her elegant kicking techniques. From July of the same year, she was forced to take an extended leave of absence due to a back injury. Upon returning in March 2024, she appealed for joining COSMIC ANGELS. After passing Mizumori Yuna's 'tropical audition', she was officially accepted by Nakano Tam at the Korakuen Hall event on April 12th."
  },
  {
    "name": "AZM",
    "company": "Stardom",
    "imageURL": "AZMStardom.png",
    "division": "Women's",
    "bio": "In 2011, the year the group launched, she passed the pro test as a third-year student, and after two years of training, debuted as a kids' fighter in the fifth grade of elementary school. In 2015, she formed the Azumi Corps. In February 2017, she was selected as the number one pick by Queen's Quest at the draft meeting. On July 26, 2020, at Korakuen Hall, she won a three-way match featuring high speed to become the champion for the first time. In November of the same year, she won the 2020 Tag League with Momo Watanabe. In February 2022, she won the high-speed championship for the second time, and with her speed and inside work as her weapons, she recorded the most defenses of the title with 12."
  },
  {
    "name": "Azusa Inaba",
    "company": "Stardom",
    "imageURL": "AzusaInabaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Bea Priestley",
    "company": "Stardom",
    "imageURL": "BeaPriestleyStardom.png",
    "division": "Women's",
    "bio": "Bea Priestley got her start at just 16 after training under Travis Banks in New Zealand, wrestling as Amy St. Clere before returning to the UK in 2016 where she made waves in Progress Wrestling, Defiant Wrestling, and RevPro’s women’s division . In late 2017 she crossed to Japan’s World Wonder Ring Stardom, joining the Oedo Tai faction and sharpening her hard-hitting style in high-profile shows through 2021 1. Priestley debuted in All Elite Wrestling in February 2019, appearing on AEW Dark and Dynamite—her striking offense and magnetic presence quickly cementing her as a key player in AEW’s women’s ranks . After departing AEW in early 2020, Priestley signed with WWE’s NXT under the ring name Blair Davenport, where she delivered standout matches but ultimately found herself sidelined by creative stagnation and budget cuts, leading to her release in February 2025. Within minutes of her WWE exit, World Wonder Ring Stardom offered her an exclusive contract, and by summer she was back in Japan—competing in the 2025 5★Star Grand Prix and instantly reasserting herself as one of joshi puroresu’s premier foreign talents"
  },
  {
    "name": "Bozilla",
    "company": "Stardom",
    "imageURL": "BozillaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Ema Maishima",
    "company": "Stardom",
    "imageURL": "EmaMaishimaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Fukigen Death",
    "company": "Stardom",
    "imageURL": "FukigenDeathStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Hanako",
    "company": "Stardom",
    "imageURL": "HanakoStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Hanan",
    "company": "Stardom",
    "imageURL": "HananStardom.png",
    "division": "Women's",
    "bio": "She is the eldest daughter of three judo sisters (Hinan and Rinan are younger sisters) who came from Tochigi Prefecture. He made his debut after graduating from elementary school. It's reassuring to see him enter the venue wearing a judo uniform and vividly decide on his specialty judo killing methods. In the Rookie of the Year match, he lost to Shibusawa Shiki and finished second. He became a high school girl fighter from spring 2020. On December 29th, 2021, he defeated Ryuuhana at the Ryogoku Kokugikan tournament and won the Future of Stardom Championship. He set the V10 record for the title's most defense record. He graduated from high school in the spring of 2023 and has completely changed his hairstyle and costume. It has a strong reputation as an icon of the future, and its growth is truly the star of tomorrow of stardom."
  },
  {
    "name": "Hazuki",
    "company": "Stardom",
    "imageURL": "HazukiStardom.png",
    "division": "Women's",
    "bio": "After graduating from junior high school, she joined Stardom. On November 20, 2016, she formed Queen's Quest with Io Shirai and Momo Watanabe at the Shinkiba 1stRING event. In April 2018, she joined Oedo Tai through the team draft. On December 24 of the same year, she won the High Speed ​​Championship for the first time at the Korakuen Hall event, and successfully defended it eight times in a row. On December 24, 2019, she retired in rebellion against the company. She returned at the Osaka-jo Hall event on October 9, 2021, and won her first tag league match that year with Koguma in 'Fukuoka W Crazy (FWC).' In October 2022, she supported the famous talent Fuwa-chan in her professional wrestling debut."
  },
  {
    "name": "Hina",
    "company": "Stardom",
    "imageURL": "HinaStardom.png",
    "division": "Women's",
    "bio": "On June 11, 2017, they made their debut in an exhibition match as the 'Hanamichi Sisters' at Shinkiba 1stRING. They started their debut with a win, defeating twin sisters. In April 2019, they joined Queen's Quest after being drafted. In August 2021, they took a temporary leave of absence to focus on their high school entrance exams. They successfully passed the exams, and on April 30 of the following year, they made their first challenge for the Future Championship held by their older sister, Hanan, at the Ota Ward General Gymnasium. Renowned for their solid fighting style, they are steadily building their careers. Then, on February 24, 2025, they achieved their long-cherished dream of becoming the 12th Future of Stardom Champion at a tournament in their hometown of Utsunomiya."
  },
  {
    "name": "Itsuki Aoki",
    "company": "Stardom",
    "imageURL": "ItsukiAokiStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Kikyo Furusawa",
    "company": "Stardom",
    "imageURL": "KikyoFurusawaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Koguma",
    "company": "Stardom",
    "imageURL": "KogumaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Konami",
    "company": "Stardom",
    "imageURL": "KonamiStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Lady C",
    "company": "Stardom",
    "imageURL": "LadyCStardom.png",
    "division": "Women's",
    "bio": "Before joining Stardom, she was an unconventional home economics teacher. She graduated from Stardom's workshop and passed the pro test after about a year as a trainee. She boasts proportions that rival those of a model, and her weapons are her long limbs and tall stature, allowing her to unleash dynamic attacks. In September 2021, despite being in the industry for less than a year, she took part in the New Japan Pro-Wrestling MetLife Dome event. A promising young wrestler, she has challenged for the Future Championship four times, starting in November 2021, but has not been crowned. She is an unfinished talent who is aiming to capture her long-awaited title for the first time."
  },
  {
    "name": "Maika",
    "company": "Stardom",
    "imageURL": "MaikaStardom.png",
    "division": "Women's",
    "bio": "After a successful career in corporate judo, she was scouted by TAKA Michinoku and joined JUST TAP OUT in 2019. Since her debut, she has demonstrated her super rookie skills by defeating veterans Mima Shimoda and Aki Shizuku with her signature judo techniques. On January 19, 2020, on Stardom's 9th anniversary, she formed Donna del Mondo with Julia and Akari. On July 17 of the same year, she won consecutive matches against Saya Kamitani at the Korakuen Hall event to capture the Future Championship, and joined Stardom the following month. On December 29, 2023, she defeated Suzu Suzuki in the World Championship match, achieving her long-awaited dream of winning the 'red belt' for the first time. In 2024, she achieved the first-ever undefeated victory at the 5★STAR GP."
  },
    {
    "name": "Maki Itoh",
    "company": "Stardom",
    "imageURL": "MakiItohStardom.png",
    "division": "Women's",
    "bio": "Maki Itoh is a former 2-time International Princess Champion and former 2-time Princess Tag Team Champion, both times alongside Miyu Yamashita. She initially debuted as a member of the idol group LinQ, and she is, currently, a member of the idol group Tokiwoikiru (トキヲイキル). She also makes appearances for American based wrestling promotions All Elite Wrestling (AEW) and Game Changer Wrestling (GCW)."
  },
  {
    "name": "Matoi Hamabe",
    "company": "Stardom",
    "imageURL": "MatoiHamabeStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Mei Seira",
    "company": "Stardom",
    "imageURL": "MeiSeiraStardom.png",
    "division": "Women's",
    "bio": "At the age of 16, she debuted with Marvelous under the ring name Hoshizuki Mei. Making a name for herself by utilizing her natural speed, she won the 2020 Wild Horse Tournament with Sendai Girls in 2020, and then captured the Sendai Girls World Junior Championship. On December 20th of the same year, she challenged AZM for the High-Speed ​​Championship, but was narrowly defeated. In August 2021, she suddenly left Marvelous. On April 23rd, 2023, she returned to Stardom at the Yokohama Arena event, changing her ring name to Seirai. On October 9th of the same year, she defeated Saki Kashima at the Dolphins Arena event, achieving her long-awaited first High-Speed ​​title."
  },
  {
    "name": "Miyu Amasaki",
    "company": "Stardom",
    "imageURL": "MiyuAmasakiStardom.png",
    "division": "Women's",
    "bio": "As a third-year high school student, she passed Stardom's 'Cinderella Audition 2020' and joined the company. In March 2022, she made an incredible debut against Utami Hayashishita in the main event of the first NEW BLOOD tournament, and joined Queen's Quest after that match. In July of the same year, she began the Supernova Best of 5 tournament. She faced Julia, Tam Nakano, Shuri, Momo Watanabe, and AZM, finishing with a record of 0-5, but showed great fighting spirit. On February 25, 2024, at the Light Cube Utsunomiya event, she challenged for the Future of Stardom title held by Rinami, but was narrowly defeated. However, on October 5, she defeated Rinami at the Dolphins Arena event, achieving her long-awaited first Future title."
  },
  {
    "name": "Momo Kohgo",
    "company": "Stardom",
    "imageURL": "MomoKohgoStardom.png",
    "division": "Women's",
    "bio": "In 2016, she became the grand prize winner at the Miss Shonan Contest, and after starring in NHK's historical dramas and films as an actress, she made her professional wrestling debut with Actress Girls. On the Mexico expedition in October 2021, she participated in the CMLL's first women's edition Grand Prix. After Actress disbanded, he joined Stardom in January 2022, and when he joined STARS, he became a unit mood maker. On his expedition to America in May 2023, he participated in the first NJPWSTRONG Championship tournament as a representative of Stardom. He has a fluent English and a talented side."
  },
  {
    "name": "Momo Watanabe",
    "company": "Stardom",
    "imageURL": "MomoWatanabeStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Natsuko Tora",
    "company": "Stardom",
    "imageURL": "NatsukoToraStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Natsupoi",
    "company": "Stardom",
    "imageURL": "NatsupoiStardom.png",
    "division": "Women's",
    "bio": "She began her career as a talent at the age of three and debuted as Maki Natsumi in Actress Girls at the age of 19. After a brief stint with Stardom, she worked with Tokyo Joshi Pro-Wrestling before appearing as a new member of Donna del Mondo at the Yokohama Budokan event on October 3, 2020. She subsequently won the Artist Championship alongside High Speed, Maika, and Himeka. After a feud with Nakano Tam, she made a surprise transfer to COSMIC ANGELS at the Tachikawa Stage Garden event on July 9, 2022. The following month, she won the Goddess title with Nakano Tam as part of the tag duo 'meltear' and released her first CD in April 2023. She finally won the long-awaited white belt at the Sapporo event on July 27, 2024."
  },
  {
    "name": "Ranna Yagami",
    "company": "Stardom",
    "imageURL": "RannaYagamiStardom.png",
    "division": "Women's",
    "bio": "With a diverse background in classical ballet and Japanese dance, she holds a third-degree black belt in karate. Admiring Akari, she joined Stardom in 2023. Although she lost her debut match against Akari, she demonstrated her potential with her sharp strikes and ground techniques. Her fighting style, which is heavily influenced by martial arts, drew attention. At the Bellesalle Takadanobaba event on January 20, 2024, she appealed directly to Akari, and joined God's Eye. In May of the same year, she participated in WAVE's 'CATCH THE WAVE 2024' and received the Special Achievement Award."
  },
  {
    "name": "Rian",
    "company": "Stardom",
    "imageURL": "RianStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Rina",
    "company": "Stardom",
    "imageURL": "RinaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Rina Yamashita",
    "company": "Stardom",
    "imageURL": "RinaYamashitaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Ruaka",
    "company": "Stardom",
    "imageURL": "RuakaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Sayaka Kurara",
    "company": "Stardom",
    "imageURL": "SayakaStardom.png",
    "division": "Women's",
    "bio": "She made her debut less than a year and a half after starting to watch professional wrestling. On January 3, 2024, she competed in the Rookie of Stardom 2023 at the Yokohama Budokan, but lost to Hanako in her first match. Still winless two months after her debut, she entered the Cinderella Tournament on March 9th, where she won by disqualification against Natsuko Tora's poison mist in the first round. Despite her disappointment, it was her first professional victory. She aspired to join COSMIC ANGELS, and finally joined the group along with Sakura Aya at the Korakuen Hall event on April 12th. Nakano Tam praised her, saying, 'She has the qualities of a genius idol.'"
  },
  {
    "name": "Saori Anou",
    "company": "Stardom",
    "imageURL": "SaoriAnouStardom.png",
    "division": "Women's",
    "bio": "She moved to Tokyo from Shiga Prefecture with the aim of becoming an actress, and after working on stage and other stages, debuted with Actress Girls in 2015. She then became the ace of the organization, becoming the first AGW champion at the Korakuen Hall event on November 15, 2018. After leaving the organization in December 2019, she became a freelancer, working for OZ Academy and Ice Ribbon. On April 2, 2023, she was called up by KAIRI for the Korakuen Hall event, making her first appearance in Stardom in six years. On December 29 of the same year, she defeated MIRAI at the Ryogoku Kokugikan event to become the Wonder Champion for the first time. In May 2025, she held a 10th anniversary event with Natsupoi."
  }, 
  {
    "name": "Saki Kashima",
    "company": "Stardom",
    "imageURL": "SakiKashimaStardom.png",
    "division": "Women's",
    "bio": "She debuted as a member of Stardom's second generation in its inaugural year. She disappeared for a while due to circumstances, but made her return for the first time in five years at the Korakuen Hall event on March 28, 2018. On January 3, 2020, at the Shinkiba 1stRING event, she betrayed Mayu Iwatani and joined Oedo Tai. At the Ota Ward General Gymnasium event on May 27, 2023, she won a three-way High Speed ​​Championship match to become the first singles champion. She was expelled from Oedo Tai in June of the same year, but was picked up by Akari and joined God's Eye. She has scored numerous come-from-behind victories with her skillful roll-up technique. She is also renowned for her beauty."
  }, 
  {
    "name": "Sareee",
    "company": "Stardom",
    "imageURL": "SareeeStardom.png",
    "division": "Women's",
    "bio": "Sareee is a Japanese joshi professional wrestler primarily performing in Japan as a freelancer, and she is the IWGP Women's Champion in her first reign. She is the producer and booker of Sareee-ISM, a promotion of self-produced shows. She is also signed to the American promotion Sukeban, where she performs under the ring name Sareee Bomb and is the Sukeban World Champion in her first reign."
  },
  {
    "name": "Saya Iida",
    "company": "Stardom",
    "imageURL": "SayaIidaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Saya Kamitani",
    "company": "Stardom",
    "imageURL": "SayaKamitaniStardom.png",
    "division": "Women's",
    "bio": "After working as a support dancer for EXILE and as a part-time AKB member, she made her professional wrestling debut in 2019. Her outstanding athleticism drew attention and she was named Rookie of the Year in 2019. She joined Queen's Quest at the Shinkiba 1stRING tournament on February 16, 2020, after being recruited by Utami Hayashishita. She won her first Cinderella Tournament in 2021, and on December 29 of the same year, she defeated Tam Nakano at the Ryogoku Kokugikan tournament to become the Wonder Champion for the first time. She holds the record for the most defenses of the title, with 15 titles. She was eliminated as a 'solo QQ' in a unit expulsion match at the Yoyogi tournament on June 22, 2024, but suddenly joined HATE at the Sapporo tournament on July 28."
  },
  {
    "name": "Starlight Kid",
    "company": "Stardom",
    "imageURL": "SLKStardom.png",
    "division": "Women's",
    "bio": "She debuted as a member of Stardom's 7th generation. Despite her small stature, she excelled in athleticism, becoming the first Future of Stardom Champion at the Korakuen Hall event on March 28, 2018. In April of the same year, she joined the regular army (later known as STARS) at the draft meeting. On June 12, 2021, she lost an all-out war against Oedo Tai and was forced to join the group. She subsequently underwent a dramatic transformation as the 'Black Kid', winning the High Speed, Goddess, and Artist titles in succession. She rose to become one of the most popular wrestlers in the organization, and released her first style book in April 2023. After being expelled from Oedo Tai at the Yokohama BUNTAI event on April 27, 2024, she formed the contemporary unit NEO GENESIS."
  },
  {
    "name": "Suzu Suzuki",
    "company": "Stardom",
    "imageURL": "SuzuSuzukiStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Syuri",
    "company": "Stardom",
    "imageURL": "SyuriStardom.png",
    "division": "Women's",
    "bio": "She debuted in Hustle under the ring name KG (Karate Girl). After the organization's activities were suspended, she participated in the launch of SMASH, and has since competed in various organizations such as WAVE and Ice Ribbon. She has also been active in the world of kickboxing and mixed martial arts. On January 19, 2020, she formed Donna del Mondo with Julia and Maika at Stardom's Korakuen Hall event. In 2021, riding the momentum of her 5★STAR GP victory, she became the first World Champion at the Ryogoku Kokugikan event on December 19th. In April 2022, she launched God's Eye with Ami Zourai and MIRAI. That same year, she won the Women's Pro Wrestling Grand Prix at the Pro Wrestling Grand Prix."
  },
  {
    "name": "Tomoka Inaba",
    "company": "Stardom",
    "imageURL": "TomokaInabaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Waka Tsukiyama",
    "company": "Stardom",
    "imageURL": "WakaTsukiyamaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Xena",
    "company": "Stardom",
    "imageURL": "XenaStardom.png",
    "division": "Women's",
    "bio": ""
  },
  {
    "name": "Yuna Mizumori",
    "company": "Stardom",
    "imageURL": "YunaMizumoriStardom.png",
    "division": "Women's",
    "bio": "Making the most of her chubby figure, she continued to perform live mainly in the Kanto region as a 'masochistic idol', and in 2018 made her professional wrestling debut with Gatoh Move. With her powerful fighting style, she managed the organization alongside Suruga Mei. In September 2022, she went freelance, and in January of the following year, she competed in Stardom's TRIANGLE DERBYI as part of '7Upp', along with Takahashi Nanae and Yuu. In June 2023, she directly appealed to COSMIC ANGELS, and succeeded in the drastic weight loss required for joining. After passing the COSMIC ANGELS promotion evaluation match, she was promoted from apprentice to regular member."
  },
  {
    "name": "Yuria Hime",
    "company": "Stardom",
    "imageURL": "YuriaHimeStardom.png",
    "division": "Women's",
    "bio": ""
  }
]