[
  {
    "name": "Arisu Endo",
    "company": "TJPW",
    "imageURL": "ArisuEndoTJPW.webp",
    "division": "Women's",
    "bio": "A former member of the idol group 'Cheer♡1', which also included Reika Saiki. Inspired by Saiki, she decided to become a pro wrestler and joined Tokyo Joshi Pro-Wrestling. She serves as a tourism ambassador for her hometown of Aizuwakamatsu, Fukushima, and is set to have her fourth homecoming show at Tsuruga Castle Gymnasium on September 13. At the '12th Tokyo Princess Cup', she fell to Miu Watanabe in the finals but had a strong run, defeating titleholder Hyper Misao, top ace Miyu Yamashita, and rival Yuki Arai. Her tag team with Suzume, 'Daisy Monkey', is also very popular."
  },
  {
    "name": "Chika Nanase",
    "company": "TJPW",
    "imageURL": "ChikaNanaseTJPW.webp",
    "division": "Women's",
    "bio": "She was already a pro wrestling fan, but after starting to watch women's wrestling, she became inspired to become a pro wrestler herself and joined Tokyo Joshi Pro-Wrestling. She made her debut in her hometown of Osaka in February 2024. Last year, on June 9th at Korakuen Hall, she secured her first singles victory against her fellow rookie, Uta Takami. She's currently battling against her seniors with powerful attacks."
  },
  {
    "name": "Haru Kazashiro",
    "company": "TJPW",
    "imageURL": "HaruKazashiroTJPW.webp",
    "division": "Women's",
     "bio": "She became a fan of Tokyo Joshi Pro-Wrestling after seeing Maki Itoh appear in the Tokyo German Village segment of 'Burari Roadside Pro-Wrestling', which aired on Amazon Prime. In addition to Itoh, she also cheered for the Bakuretsu Sisters, and after watching Nodoka Tenma's graduation match, she decided to become a wrestler herself. She defeated Toga in the 'Next Generation Tournament 24' to claim her first championship. Her hobbies include special effects (tokusatsu) like Kamen Rider, and anime."
  },
  {
    "name": "Haruna Neko",
    "company": "TJPW",
    "imageURL": "HarunaNekoTJPW.webp",
    "division": "Women's",
    "bio": "She's the shortest wrestler in Tokyo Joshi Pro-Wrestling at 143cm (4 feet 8 inches), and as her ring name suggests, she wrestles with cat ears and a tail. Since her debut, her cat-like fighting style has evolved, incorporating more scratching attacks and agile movements each year. After undergoing surgery for a ruptured left anterior cruciate ligament (ACL) and a left meniscus tear, she made her return last October after approximately a year-long absence. However, she sustained a right knee injury just before the June 21st Kofu show, which was to be her hometown return. She will be on a long-term hiatus after the Kofu event for surgery and rehabilitation."
  },
  {
    "name": "HIMAWARI",
    "company": "TJPW",
    "imageURL": "HIMAWARITJPW.webp",
    "division": "Women's",
    "bio": "She wields her super long hair in matches, which she claims she hasn't cut since birth (except for her bangs), though she often accidentally chokes herself with it. She's showing significant growth, including her challenge for Suzume's International Princess Championship at the Kasukabe Fureai Cube on May 3rd. She also works as a stage actress."
  },
  {
    "name": "Hyper Misao",
    "company": "TJPW",
    "imageURL": "HyperMisaoTJPW.webp",
    "division": "Women's",
    "bio": "The new hero defending love and peace in Tokyo Joshi Pro-Wrestling. Known for her lengthy pre-match promos and cunning in-ring tactics. Her self-produced shows, 'HYPE!', have received high praise, taking place three times in total: May 2023, April 2024, and June 2025. She also actively competes as part of the tag team 'Kyōraku Kyōmei' with Shoko Nakajima, having captured the Princess Tag Team Championship on March 16th at Ota City General Gymnasium. She is currently on a dominant defense streak, having defeated 'Hakuchumu' on July 21st at Ota City General Gymnasium."
  },
  {
    "name": "Kaya Toribami",
    "company": "TJPW",
    "imageURL": "KayaToribamiTJPW.webp",
    "division": "Women's",
    "bio": "She's a masked wrestler who debuted at 'CyberFight Festival 2021.' Her motif isn't a phoenix or a crow, but a cassowary. Recently, her birthday and blood type were revealed. She excels at acrobatic movements, and her 'Sentouchoryu' (Fighting Bird Style) is a must-see. On June 7th in Shinagawa, she challenged Shoko Nakajima for her MLW World Women's Featherweight Championship, Nakajima being the one who inspired her to enter the pro wrestling world. Her nickname is Torippy."
  },
  {
    "name": "Kira Summer",
    "company": "TJPW",
    "imageURL": "KiraSummerTJPW.webp",
    "division": "Women's",
    "bio": "During her student days, she attended a local wrestling school. She loves Japanese anime and moved to Japan to work as an animator. Unable to abandon her dream of becoming a pro wrestler, she's been training diligently while raising her child. Last October, she formed her first-ever sister tag team with her older sister, Miki Fortune, who is also a professional wrestler."
  },
  {
    "name": "Mahiro Kiryu",
    "company": "TJPW",
    "imageURL": "MahiroKiryuTJPW.webp",
    "division": "Women's",
    "bio": "She's a veteran of the working world, known for performing a dogeza (bowing deeply in apology) on top of her opponents. Last November, she held her first successful hometown show at G Messe Gunma. In this past January's tag tournament, she entered with Haruna Neko as 'Nekonchu' but was defeated in the first round. She's frequently run over by Hyper Misao's combat bicycle, the 'Hypermi Dramatic Dream.' She also loves mahjong."
  },
  {
    "name": "Mifu Ashida",
    "company": "TJPW",
    "imageURL": "MifuAshidaTJPW.webp",
    "division": "Women's",
    "bio": "Mifu Ashida's journey to the wrestling ring is a unique one. During her student years, she was a dedicated cheer dancer, even placing third in the largest cheer dance competition in the United States. Her foray into the entertainment world began in 2013 as a finalist for 'Miss Teen Japan.' Currently, Mifu balances her talent activities with her role as the JAPAN AMBASSADOR 2024 semi-grand prix winner. Her path to professional wrestling started with an audition for a film centered on the sport. Since January of this year, she has brought her talents to Tokyo Joshi Pro-Wrestling, where she's eager to quickly catch up to the top contenders."
  },
  {
    "name": "Miu Watanabe",
    "company": "TJPW",
    "imageURL": "MiuWatanabeTJPW.webp",
    "division": "Women's",
    "bio": "She is the pink member of the idol group Up Up Girls (Pro Wrestling). Having refined her strength, a video of her giving two people a Giant Swing at once went viral. Last year, she led the promotion as the young Princess of Princess Champion. After winning her first 12th Tokyo Princess Cup, she will have a rematch against Mizuki on September 20 at Ota City General Gymnasium to once again reclaim the Princess title. She is also famous for being an idol otaku."
  },
  {
    "name": "Maki Itoh",
    "company": "TJPW",
    "imageURL": "MakiItohTJPW.webp",
    "division": "Women's"
  },
  {
    "name": "Miyu Yamashita",
    "company": "TJPW",
    "imageURL": "Miyu YamashitaTJPW.webp",
    "division": "Women's",
    "bio": "A top-tier ace who moved from Fukuoka to Tokyo and made her debut at the age of 17. On April 18, she challenged Mizuki for the Princess of Princess Championship in Las Vegas, after which she primarily wrestled overseas until July 21 at Ota City General Gymnasium. At Korakuen Hall on August 23, she announced her appointment as the inaugural leader, and as such, she will support the promotion by uniting the wrestlers."
  },
  {
    "name": "Mizuki",
    "company": "TJPW",
    "imageURL": "MizukiTJPW.webp",
    "division": "Women's",
    "bio": "Debuting in 2012, this wrestler became a regular on Tokyo Joshi Pro-Wrestling shows starting in April 2017, and officially joined the promotion in November 2020. Her spinning body attack, the 'Uzuame', garnered over 100 million views on social media, leading to her being featured in various media outlets. On January 4th at Korakuen Hall, she defeated Miyu Watanabe to win her second Princess of Princess Championship. She is currently on a dominant championship run, having successfully defended her title against Rika Tatsumi on March 16th at Ota City General Gymnasium, Miyu Yamashita on April 18th in Las Vegas, and Yuki Arai on July 21st at Ota City General Gymnasium."
  },
  {
    "name": "Moka Miyamoto",
    "company": "TJPW",
    "imageURL": "MokaMiyamotoTJPW.webp",
    "division": "Women's",
    "bio": "She became interested in professional wrestling through the influence of her younger brother and joined Tokyo Joshi Pro-Wrestling. In high school, she studied Shotokan karate and holds a shodan (first-degree black belt), which is why she sometimes uses straight punches and 'kawara-wari' (tile-breaking) moves during her matches. At the Ota City General Gymnasium event on July 21, she defeated her contemporary, Suzume, to win the International Princess Championship. This marked the first title of her career, but she later had to take an extended leave due to poor health, which led to her relinquishing the belt."
  },
 {
    "name": "Pom Harajuku",
    "company": "TJPW",
    "imageURL": "PomHarajukuTJPW.webp",
    "division": "Women's",
    "bio": "She proclaims herself an eternal three-year-old, born and raised in Harajuku. She gained attention for her friendship story with 'The Monster' Max the Impaler. Last November, in Thailand, where she first encountered professional wrestling, she captured her first singles title, the SETUP All Asia Women's Championship. Her self-produced portrait series, 'Pom-trait,' featuring candid shots of wrestlers in their private clothes, is also very popular."
  },
  {
    "name": "Raku",
    "company": "TJPW",
    "imageURL": "RakuTJPW.webp",
    "division": "Women's",
    "bio": "She's the yellow-themed member of Up Up Girls (Pro-Wrestling). During MC segments, her gentle way of speaking creates a unique atmosphere. She's also a railroad enthusiast, and her move names often incorporate railway terminology. On February 15th, she achieved her dream of participating in a Shinkansen Joshi Pro-Wrestling event and also captured the Ironman Heavymetalweight Championship for the first time, a title she had targeted. In March, she won her first overseas title, the SETUP All Asia Women's Championship, but lost it to Matcha on May 31st. She's connected to Yuki Aino and Pom Harajuku in a complex friendship, including a 'Friendship triangle' of mutual admiration."
  },
  {
    "name": "Ren Konatsu",
    "company": "TJPW",
    "imageURL": "RenKonatsuTJPW.webp",
    "division": "Women's",
    "bio": "Originally a fan of SKE48, she started watching Tokyo Joshi Pro-Wrestling after Yuki Arai's participation, and inspired by Suzume, decided to become a professional wrestler. She debuted against Suzume at the June 1st Chunichi Hall event. Her catchphrase is 'Powari Hajikeru Fancy Sheep' (Popping Fancy Sheep)."
  },
  {
    "name": "Rika Tatsumi",
    "company": "TJPW",
    "imageURL": "RikaTatsumiTJPW.webp",
    "division": "Women's",
    "bio": "Her ring name utilizes her real name, Rika, with President Sanshiro Takagi famously stating, 'When you say Rika, it has to be Tatsumi Rika', and thus naming her. She has honed her inherent 'crazy fight' style, sometimes even showing a psychopathic side by putting her hands around opponents' necks. At Ota City General Gymnasium on March 16th this year, she was defeated by Mizuki, failing to reclaim the Princess of Princess Championship, but her love for Mizuppyon remains unchanged."
  },
  {
    "name": "Shino Suzuki",
    "company": "TJPW",
    "imageURL": "ShinoSuzukiTJPW.webp",
    "division": "Women's",
    "bio": "She's the green-themed member of Up Up Girls (Pro-Wrestling). Although she had a job as a bus tour guide, she couldn't give up her dream of becoming an idol, so she applied for and passed the audition to become a new member of Up Up Girls (Pro-Wrestling), making her pro wrestling debut. In this year's tag tournament, she's teamed up with her fellow trainee/rookie HIMAWARI. She's also known to give tour guidance/commentary during matches."
  },
  {
    "name": "Shoko Nakajima",
    "company": "TJPW",
    "imageURL": "ShokoNakajimaTJPW.webp",
    "division": "Women's",
    "bio": "A former comedian, this wrestler was a member of Yoshimoto Kogyo's Tokyo NSC 16th class before joining Tokyo Joshi Pro-Wrestling. As one of the promotion's founding members, she brings bright, fun, and intense wrestling to the ring as part of the tag team 'Kyōraku Kyōmei' alongside Hyper Misao. This year has been particularly successful: on February 8th at Korakuen Hall, she and Misao secured their first tag team tournament victory. Then, on March 16th at Ota City General Gymnasium, Kyōraku Kyōmei defeated 121000000 to capture the Princess Tag Team Championship. On April 5th, she defeated Delmi Exo at MLW in the United States to win the MLW Women's World Featherweight Championship, making her a double champion. Most recently, she successfully defended her title against Kaya Toribami on June 7th at Shinagawa Club eX."
  },
  {
    "name": "Suzume",
    "company": "TJPW",
    "imageURL": "SuzumeTJPW.webp",
    "division": "Women's",
    "bio": "She became a professional wrestler after being invited by a friend to watch Tokyo Joshi Pro-Wrestling. In January of this year, she captured her first singles title, the International Princess Championship, and successfully defended it five times. However, she was defeated by Moka Miyamoto at the Ota City General Gymnasium on July 21st, falling short of tying Yuki Arai's record for most defenses. She is currently active in the tag team 'DaisyMonkey' with Arisu Endo."
  },
  {
    "name": "Toga",
    "company": "TJPW",
    "imageURL": "TogaTJPW.webp",
    "division": "Women's",
    "bio": "She's been a pro wrestling fan since elementary school, regularly attending shows. After seeing Saki Akai compete against male wrestlers, she decided she wanted to become a pro wrestler herself and joined Tokyo Joshi Pro-Wrestling. She was the runner-up in the 'Next Gen Tournament 24', a close second. Despite that, she's continued to show growth, including her first challenge for the Princess Tag Team Championship last December, teaming with the tournament winner Haru Kazashiro, and participating in this January's tag tournament."
  },
  {
    "name": "Uta Takami",
    "company": "TJPW",
    "imageURL": "UtaTakamiTJPW.webp",
    "division": "Women's",
    "bio": "She's the white-themed member of Up Up Girls (Pro-Wrestling). Despite being a huge fan (an 'otaku') of Miu Watanabe, she applied for and passed the audition to become a new member of Up Up Girls (Pro-Wrestling). Though she's the third shortest wrestler in the promotion, behind Haruna Neko and Shoko Nakajima, her dynamic dropkicks are a must-see. She earned her first singles victory on April 19th at Kanda Myojin Hall."
  },
  {
    "name": "Wakana Uehara",
    "company": "TJPW",
    "imageURL": "WakanaUeharaTJPW.webp",
    "division": "Women's",
    "bio": "She joined 'Yume Pro-Wrestling' (Dream Pro-Wrestling) in May 2022, a project dedicated to helping individuals achieve their dreams through professional wrestling. While continuing her work as a talent, she dedicated herself to wrestling and made her professional wrestling debut at the Korakuen Hall event on January 4, 2023. She won the 'Next Generation Tournament 23', a competition among six同期 (contemporaries/rookies), and on January 4th the following year at Korakuen Hall, she had a singles match against Aja Kong, who served as a guest coach for 'Yume Pro-Wrestling.' This year, she officially launched a tag team with Yuki Kamifuku. They named their team 'Ober Eats' and challenged for the Princess Tag Championship in Las Vegas on April 18th."
  },
  {
    "name": "Yuki Aino",
    "company": "TJPW",
    "imageURL": "YukiAinoTJPW.webp",
    "division": "Women's",
    "bio": "Yuki Aino's elder sister is Nodoka Tenma (who retired in 2022). Interestingly, Yuki herself is the second-generation ring announcer. In her sixth attempt, she achieved her first runner-up finish in the 11th Tokyo Princess Cup, a singles tournament held in the summer of 2024. She often teams up with Raku and Harajuku Pom in a special, interdependent trio dynamic often built on mutual admiration and a fan-favored relationship."
  },
  {
    "name": "Yuki Arai",
    "company": "TJPW",
    "imageURL": "YukiAraiTJPW.webp",
    "division": "Women's",
    "bio": "She was a member of the idol group SKE48 for approximately 12 years until the end of March 2025. In May 2021, she fully entered the world of professional wrestling while still active with SKE48. That same year, she won Rookie of the Year awards from both the Tokyo Sports Newspaper (2021 Pro-Wrestling Awards) and Weekly Pro-Wrestling (Pro-Wrestling Grand Prix 2021). She steadily climbed the ranks, capturing the Princess Tag Championship in 2022 and the International Princess Championship in 2024. Even after graduating from SKE48, she continues to be active in various endeavors, including releasing her first photobook, Muteki no Sugao (Invincible Bare Face), demonstrating her versatility solely under the title of 'professional wrestler.'"
  },
  {
    "name": "Yuki Kamifuku",
    "company": "TJPW",
    "imageURL": "YukiKamifukuTJPW.webp",
    "division": "Women's",
    "bio": "A former runner-up in the Miss Toyo University pageant, this wrestler has frequently appeared in gravure (magazine photoshoots) and even released her own photobook, Kyaku-zai (Leg Crime). More recently, she has been dominating the Asian wrestling scene as a double champion, holding both the 'Queen of Asia Championship' from Singapore and the 'VPW Women's Championship' from Vietnam. This year, she officially launched 'Ober Eats', her tag team with Wakana Uehara, and challenged Kyōraku Kyōmei for the Princess Tag Team Championship in Las Vegas on April 18th."
  }
]