[
  {
    "name": "Chiaki",
    "company": "Marigold",
    "imageURL": "ChiakiMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Chika Goto",
    "company": "Marigold",
    "imageURL": "ChikaGotoMarigold.webp",
    "division": "Women's",
    "bio":"Active in gravure after being a finalist in Miss FLASH 2022. Proud of her tall height, she made her professional wrestling debut in Actress Girls as a 'fighting gravure actress.'"
  },
  {
    "name": "Gigaton",
    "company": "Marigold",
    "imageURL": "GigatonMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Hummingbird",
    "company": "Marigold",
    "imageURL": "HummingbirdMarigold.webp",
    "division": "Women's",
    "bio":"Suddenly appearing at the Korakuen Hall event on October 7, 2024, she declared a challenge for the Super Flyweight Championship held by Natsumi Shozuki. She received a sudden title match in her first battle at Korakuen Hall on October 24. Her soft body movement and numerous tricky actions are expected to bring a new breeze in the future, being a masked beauty."
  },
  {
    "name": "Kizuna Tanaka",
    "company": "Marigold",
    "imageURL": "KizunaTanakaMarigold.webp",
    "division": "Women's",
    "bio":"Born a thoroughbred with her father being the professional wrestler Minoru Tanaka and her mother being the former professional wrestler Yumi Fukawa. She aimed to be a professional wrestler from her girlhood and joined Pro Wrestling WAVE in high school. She debuted at the same time as her graduation. She stands out with a cute look inherited from her mother and a submission like her father, and won the WAVE Certified Tag Championship."
  },
  {
    "name": "Komomo Minami",
    "company": "Marigold",
    "imageURL": "KomomoMinamiMarigold.webp",
    "division": "Women's",
    "bio":"She was set to debut as a Stardom trainee, but had to withdraw due to an injury. She returned to her hometown in Fukuoka, but moved back to Tokyo in April 2024 and became a trainee for Marigold. She made her long-awaited debut in a match against MIRAI on June 11."
  },
  {
    "name": "Kouki Amarei",
    "company": "Marigold",
    "imageURL": "KoukiAmareiMarigold.webp",
    "division": "Women's",
    "bio": "She has a background in classical ballet and street dance. After working as a stage actress, she made her ring debut with Actwres girl'Z. She was quickly anticipated to be an ace candidate, and her tall, dignified presence makes her a shining knight representing the era. Upon joining Marigold, she took the ring name Amarei Kouki."
  },
  {
    "name": "Mai Sakurai",
    "company": "Marigold",
    "imageURL": "MaiSakuraiMarigold.webp",
    "division": "Women's",
    "bio":"She made her professional wrestling debut in Actress Girls. Her fights range from SM tag matches, hardcore battles, to battles with sexy jo-yu, showcasing a wide spectrum of skills."
  },
  {
    "name": "Mayu Iwatani",
    "company": "Marigold",
    "imageURL": "MayuIwataniMarigold.webp",
    "division": "Women's",
    "bio": "She is a Stardom first-generation talent who has walked alongside the promotion's history as its icon. A quintessential heroine symbolizing Stardom, she became the first-ever simultaneous Red Belt and White Belt champion in June 2017, and holds the record for most Goddess of Stardom Championship defenses. As the leader of STARS, her sparkling and exciting fighting style consistently captivated fans, making her a central figure in Stardom. On April 23, 2023, she defeated Mercedes Moné at Yokohama Arena to capture the IWGP Women's Championship. She departed Stardom on April 28, 2025, and made her new debut with Marigold on May 1st. Her catchphrase is, 'Everyone, good evening!'"
  },
  {
    "name": "Megaton",
    "company": "Marigold",
    "imageURL": "MegatonMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Miku Aono",
    "company": "Marigold",
    "imageURL": "MikuAonoMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Mirai",
    "company": "Marigold",
    "imageURL": "MiraiMarigold.webp",
    "division": "Women's",
    "bio": "She was affected by the Great East Japan Earthquake when she was in elementary school. After watching a charity martial arts and professional wrestling event for reconstruction, she decided to become a professional wrestler and started learning judo. After graduating from high school, she moved to Tokyo and made her debut in Tokyo Joshi Pro Wrestling."
  },
  {
    "name": "Misa Matsui",
    "company": "Marigold",
    "imageURL": "MisaMatsuiMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Nagisa Nozaki",
    "company": "Marigold",
    "imageURL": "NagisaNozakiMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Nagisa Tachibana",
    "company": "Marigold",
    "imageURL": "NagisaTachibanaMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Nanae Takahashi",
    "company": "Marigold",
    "imageURL": "NanaeTakahashiMarigold.webp",
    "division": "Women's"
  },
  {
    "name": "Nao Ishikawa",
    "company": "Marigold",
    "imageURL": "NaoIshikawaMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Natsumi Showzuki",
    "company": "Marigold",
    "imageURL": "NatsumiShowzukiMarigold.webp",
    "division": "Women's"
  },
  {
    "name": "Rea Sato",
    "company": "Marigold",
    "imageURL": "ReaSetoMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Riara",
    "company": "Marigold",
    "imageURL": "RiaraMarigold.webp",
    "division": "Women's"
  },
  {
    "name": "Ryoko Sakimura",
    "company": "Marigold",
    "imageURL": "RyokoSakimuraMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Seri Yamaoka",
    "company": "Marigold",
    "imageURL": "SeriYamaokaMarigold.webp",
    "division": "Women's",
    "bio":"Influenced by her older siblings, she started wrestling in elementary school and quickly distinguished herself, dreaming of becoming an Olympic athlete. However, injuries forced her to give up that dream. As a second career, she aspired to become a women's wrestler and joined Marigold. She aims to become a star recognized worldwide. Her older sister, two years her senior, is former wrestler and current gravure idol, Miyabi Yamaoka, who was also selected for Miss Magazine. She was highly praised by the media after her debut match and is a true talent who captured the Twin Star Championship in just her fifth match."
  },
  {
    "name": "Shinno",
    "company": "Marigold",
    "imageURL": "ShinnoMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Utami",
    "company": "Marigold",
    "imageURL": "UtamiHayashishitaMarigold.webp",
    "division": "Women's",
    "bio":"The third daughter of Kiyoshi Hayashishita, known as Big Daddy. Influenced by her father, she started judo and earned her first dan. She debuted as an amazing big rookie and swept all the major titles in Stardom. In November 2020, she defeated Mayu Iwatani and achieved her long-cherished dream of the red belt in the shortest time ever since her debut. She is leading the new era of Marigold."
  },
  {
    "name": "Victoria Yuzuki",
    "company": "Marigold",
    "imageURL": "VictoriaYuzukiMarigold.webp",
    "division": "Women's",
    "bio":"A super rookie who leveraged her 9-year judo career and excellent athletic abilities. With her impressive presence and physical abilities, she defeated HANAKO and won the rookie championship."
  },
  {
    "name": "Yuuka Yamazaki",
    "company": "Marigold",
    "imageURL": "YuukaYamazakiMarigold.webp",
    "division": "Women's",
    "bio":""
  },
  {
    "name": "Yuuki Minami",
    "company": "Marigold",
    "imageURL": "YuukiMinamiMarigold.webp",
    "division": "Women's",
    "bio":""
  }
]